In [11]:
pip install pandas

Requirement already satisfied: pandas in c:\users\hp\appdata\local\programs\python\python311\lib\site-packages (2.0.2)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\hp\appdata\local\programs\python\python311\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\hp\appdata\local\programs\python\python311\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: tzdata>=2022.1 in c:\users\hp\appdata\local\programs\python\python311\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: numpy>=1.21.0 in c:\users\hp\appdata\local\programs\python\python311\lib\site-packages (from pandas) (1.25.0)
Requirement already satisfied: six>=1.5 in c:\users\hp\appdata\local\programs\python\python311\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip available: 22.3.1 -> 23.1.2
[notice] To update, run: python.exe -m pip install --upgrade pip

In [1]:
import pandas as pd

In [3]:
series1=pd.Series([35.467,63.951,80.940,60.665,127.067,64.511,318.523])
series1

0     35.467
1     63.951
2     80.940
3     60.665
4    127.067
5     64.511
6    318.523
dtype: float64

In [5]:
l1=[10,"hi",30.5,True,50]
new_series1=pd.Series(l1)
new_series1

0      10
1      hi
2    30.5
3    True
4      50
dtype: object

In [6]:
dict_series=pd.Series({'Canada':35.4,'France':63.9,'Italy':53.9})
dict_series

Canada    35.4
France    63.9
Italy     53.9
dtype: float64

In [7]:
series2=pd.Series([35.467,63.951,80.940,60.665,127.067,64.511,318.523],index=["Canada","Italy","USA","UK","France","Germany","Japan"])
series2

Canada      35.467
Italy       63.951
USA         80.940
UK          60.665
France     127.067
Germany     64.511
Japan      318.523
dtype: float64

In [8]:
data=[10,20,30,40,50]
index_labels=['A','B','C','D','E']
series3=pd.Series(data,index=index_labels)
series3

A    10
B    20
C    30
D    40
E    50
dtype: int64

In [9]:
series3.index=[1,2,3,4,5]
series3

1    10
2    20
3    30
4    40
5    50
dtype: int64

In [10]:
series2.name="panda series"
series2

Canada      35.467
Italy       63.951
USA         80.940
UK          60.665
France     127.067
Germany     64.511
Japan      318.523
Name: panda series, dtype: float64

In [11]:
series2[1]

63.951

In [12]:
series2['Canada']

35.467

In [14]:
print(series2[1:4])

Italy    63.951
USA      80.940
UK       60.665
Name: panda series, dtype: float64

In [15]:
print(series2['UK':'Japan'])

UK          60.665
France     127.067
Germany     64.511
Japan      318.523
Name: panda series, dtype: float64

In [17]:
print(series2[series2>50])

Italy       63.951
USA         80.940
UK          60.665
France     127.067
Germany     64.511
Japan      318.523
Name: panda series, dtype: float64

In [19]:
print(series2.loc['USA'])

80.94

In [20]:
print(series2.loc[['USA','Japan']])

USA       80.940
Japan    318.523
Name: panda series, dtype: float64

In [22]:
print(series2.loc['USA':'Germany'])

USA         80.940
UK          60.665
France     127.067
Germany     64.511
Name: panda series, dtype: float64

In [24]:
print(series2.iloc[2])

80.94

In [25]:
print(series2.iloc[[0,2]])

Canada    35.467
USA       80.940
Name: panda series, dtype: float64

In [26]:
print(series2.iloc[1:4])

Italy    63.951
USA      80.940
UK       60.665
Name: panda series, dtype: float64

In [28]:
math_series1=pd.Series([10,20,30])
math_series2=pd.Series([1,2,3])

In [29]:
print(math_series1+math_series2)

0    11
1    22
2    33
dtype: int64

In [30]:
print(math_series1-math_series2)

0     9
1    18
2    27
dtype: int64

In [31]:
print(math_series1*math_series2)

0    10
1    40
2    90
dtype: int64

In [32]:
print(math_series1/math_series2)

0    10.0
1    10.0
2    10.0
dtype: float64

In [33]:
print(math_series1**2)

0    100
1    400
2    900
dtype: int64

In [34]:
series2

Canada      35.467
Italy       63.951
USA         80.940
UK          60.665
France     127.067
Germany     64.511
Japan      318.523
Name: panda series, dtype: float64

In [35]:
print(series2.sum())

751.124

In [37]:
print(series2.mean())

107.30342857142857

In [38]:
print(series2.median())

64.511

In [39]:
print(series2.max())

318.523

In [40]:
print(series2.min())

35.467

In [41]:
print(series2.std())

97.25017306900992

In [42]:
print(series2.var())

9457.596161952382

In [43]:
series2>70

Canada     False
Italy      False
USA         True
UK         False
France      True
Germany    False
Japan       True
Name: panda series, dtype: bool

In [44]:
series2[series2>70]

USA        80.940
France    127.067
Japan     318.523
Name: panda series, dtype: float64

In [45]:
mod_series1=pd.Series([35.467,63.951,80.940,60.665,127.067,64.511,318.523],index=["Canada","Italy","USA","UK","France","Germany","Japan"])
mod_series1

Canada      35.467
Italy       63.951
USA         80.940
UK          60.665
France     127.067
Germany     64.511
Japan      318.523
dtype: float64

In [48]:
mod_series1['Canada']=55.6
mod_series1

Canada      55.600
Italy       63.951
USA         80.940
UK          60.665
France     127.067
Germany     64.511
Japan      318.523
canada      55.600
dtype: float64

In [49]:
mod_series2=pd.Series([35.467,63.951,80.940,60.665,127.067,64.511,318.523],index=["Canada","Italy","USA","UK","France","Germany","Japan"])
mod_series2

Canada      35.467
Italy       63.951
USA         80.940
UK          60.665
France     127.067
Germany     64.511
Japan      318.523
dtype: float64

In [51]:
mod_series2[mod_series2>70]=0
mod_series2

Canada     35.467
Italy      63.951
USA         0.000
UK         60.665
France      0.000
Germany    64.511
Japan       0.000
dtype: float64

In [52]:
mod_series3=pd.Series([10,20,30,40,50])
mod_series3

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [53]:
mod_series3=mod_series3.apply(lambda x:x*2)
mod_series3

0     20
1     40
2     60
3     80
4    100
dtype: int64

In [54]:
mod_series4=pd.Series([10,20,30,40,50])
mod_series4

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [55]:
mod_series4=mod_series4.replace({20:25,30:35})
mod_series4

0    10
1    25
2    35
3    40
4    50
dtype: int64

In [56]:
lg_series=pd.Series([10,20,30,40,50])
lg_series

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [57]:
result_and=lg_series[(lg_series>20)&(lg_series<40)]
result_and

2    30
dtype: int64

In [59]:
result_or=lg_series[(lg_series<20)|(lg_series>40)]
result_or

0    10
4    50
dtype: int64

In [60]:
result_not=lg_series[~(lg_series>30)]
result_not

0    10
1    20
2    30
dtype: int64

In [2]:
import pandas as pd

In [5]:
series2=pd.Series([35.467,63.951,80.940,60.665,127.067,64.511,318.523],index=["Canada","Italy","USA","UK","France","Germany","Japan"])
series2

Canada      35.467
Italy       63.951
USA         80.940
UK          60.665
France     127.067
Germany     64.511
Japan      318.523
dtype: float64

In [6]:
print(series2[(series2>series2.mean()-series2.std()/2)|(series2>series2.mean()+series2.std()/2)])

Italy       63.951
USA         80.940
UK          60.665
France     127.067
Germany     64.511
Japan      318.523
dtype: float64

In [11]:
data1={'Name':['john','Jane','Mike','Sara'],
               'Age':[25,30,35,28],
               'City':['New York','London','Paris','Sidney']}
df1=pd.DataFrame(data1)
df1

   Name  Age      City
0  john   25  New York
1  Jane   30    London
2  Mike   35     Paris
3  Sara   28    Sidney

In [14]:
data2=[{'Name':'John','Age':30},{'Name':'Jane','Age':35},{'Name':'Mike','Age':28}]
df2=pd.DataFrame(data2)
df2

   Name  Age
0  John   30
1  Jane   35
2  Mike   28

In [15]:
import numpy as np

In [17]:
data3=np.array([[1,2,3],[4,5,6],[7,8,9]])
columns=['A','B','C']
df3=pd.DataFrame(data3,columns=columns)
df3

   A  B  C
0  1  2  3
1  4  5  6
2  7  8  9

In [19]:
df4=pd.DataFrame(np.array([[1,2,3],[4,5,6],[7,8,9]]),index=['I','II','III'],columns=['A','B','C'])
df4

     A  B  C
I    1  2  3
II   4  5  6
III  7  8  9

In [20]:
df5 = pd.DataFrame({
    'Population': [35.467, 63.951, 80.94 , 60.665, 127.061, 64.511, 318.523],
    'GDP': [1785387,2833687,3874437,2167744,4602367,2950039,17348075],
    'Surface Area': [9984670,640679,357114,301336,377930,242495,9525067],
    'HDI': [0.913,0.888,0.916,0.873,0.891,0.907,0.915],
    'Continent': ['America','Europe','Europe','Europe','Asia','Europe','America']
}) 
df5

   Population       GDP  Surface Area    HDI Continent
0      35.467   1785387       9984670  0.913   America
1      63.951   2833687        640679  0.888    Europe
2      80.940   3874437        357114  0.916    Europe
3      60.665   2167744        301336  0.873    Europe
4     127.061   4602367        377930  0.891      Asia
5      64.511   2950039        242495  0.907    Europe
6     318.523  17348075       9525067  0.915   America

In [21]:
df5.index = ['Canada','France','Germany','Italy','Japan','United Kingdom','United States',]
df5

                Population       GDP  Surface Area    HDI Continent
Canada              35.467   1785387       9984670  0.913   America
France              63.951   2833687        640679  0.888    Europe
Germany             80.940   3874437        357114  0.916    Europe
Italy               60.665   2167744        301336  0.873    Europe
Japan              127.061   4602367        377930  0.891      Asia
United Kingdom      64.511   2950039        242495  0.907    Europe
United States      318.523  17348075       9525067  0.915   America

In [22]:
df5.loc['Canada']

Population       35.467
GDP             1785387
Surface Area    9984670
HDI               0.913
Continent       America
Name: Canada, dtype: object

In [23]:
df5.loc['Italy']

Population       60.665
GDP             2167744
Surface Area     301336
HDI               0.873
Continent        Europe
Name: Italy, dtype: object

In [24]:
df5.iloc[-1]

Population       318.523
GDP             17348075
Surface Area     9525067
HDI                0.915
Continent        America
Name: United States, dtype: object

In [25]:
df5.iloc[-2]

Population       64.511
GDP             2950039
Surface Area     242495
HDI               0.907
Continent        Europe
Name: United Kingdom, dtype: object

In [26]:
df5['Population']

Canada             35.467
France             63.951
Germany            80.940
Italy              60.665
Japan             127.061
United Kingdom     64.511
United States     318.523
Name: Population, dtype: float64

In [27]:
df5[['Population','GDP']]

                Population       GDP
Canada              35.467   1785387
France              63.951   2833687
Germany             80.940   3874437
Italy               60.665   2167744
Japan              127.061   4602367
United Kingdom      64.511   2950039
United States      318.523  17348075

In [29]:
df5[['Population','HDI']]

                Population    HDI
Canada              35.467  0.913
France              63.951  0.888
Germany             80.940  0.916
Italy               60.665  0.873
Japan              127.061  0.891
United Kingdom      64.511  0.907
United States      318.523  0.915

In [30]:
df5[1:3] #df5.iloc[1:3]

         Population      GDP  Surface Area    HDI Continent
France       63.951  2833687        640679  0.888    Europe
Germany      80.940  3874437        357114  0.916    Europe

In [31]:
df5['France':'Italy'] #df5.loc['france':'italy']

         Population      GDP  Surface Area    HDI Continent
France       63.951  2833687        640679  0.888    Europe
Germany      80.940  3874437        357114  0.916    Europe
Italy        60.665  2167744        301336  0.873    Europe

In [32]:
df5.loc['France':'Italy',['Population','GDP']]

         Population      GDP
France       63.951  2833687
Germany      80.940  3874437
Italy        60.665  2167744

In [33]:
df5.loc['France':'Italy',['Population']]

         Population
France       63.951
Germany      80.940
Italy        60.665

In [34]:
df5.iloc[[0,1,-1,-2]]

                Population       GDP  Surface Area    HDI Continent
Canada              35.467   1785387       9984670  0.913   America
France              63.951   2833687        640679  0.888    Europe
United States      318.523  17348075       9525067  0.915   America
United Kingdom      64.511   2950039        242495  0.907    Europe

In [35]:
df5['Population']>70

Canada            False
France            False
Germany            True
Italy             False
Japan              True
United Kingdom    False
United States      True
Name: Population, dtype: bool

In [38]:
df5[df5['Population']>70]

               Population       GDP  Surface Area    HDI Continent
Germany            80.940   3874437        357114  0.916    Europe
Japan             127.061   4602367        377930  0.891      Asia
United States     318.523  17348075       9525067  0.915   America

In [39]:
df5.loc[df5['Population']>70,'Population']

Germany           80.940
Japan            127.061
United States    318.523
Name: Population, dtype: float64

In [40]:
df5.loc[df5['Population']>70,['Population','GDP']]

               Population       GDP
Germany            80.940   3874437
Japan             127.061   4602367
United States     318.523  17348075

In [1]:
import pandas as pd

In [3]:
df5 = pd.DataFrame({
    'Population': [35.467, 63.951, 80.94 , 60.665, 127.061, 64.511, 318.523],
    'GDP': [1785387,2833687,3874437,2167744,4602367,2950039,17348075],
    'Surface Area': [9984670,640679,357114,301336,377930,242495,9525067],
    'HDI': [0.913,0.888,0.916,0.873,0.891,0.907,0.915],
    'Continent': ['America','Europe','Europe','Europe','Asia','Europe','America']
}) 
df5

   Population       GDP  Surface Area    HDI Continent
0      35.467   1785387       9984670  0.913   America
1      63.951   2833687        640679  0.888    Europe
2      80.940   3874437        357114  0.916    Europe
3      60.665   2167744        301336  0.873    Europe
4     127.061   4602367        377930  0.891      Asia
5      64.511   2950039        242495  0.907    Europe
6     318.523  17348075       9525067  0.915   America

In [4]:
df5.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Population    7 non-null      float64
 1   GDP           7 non-null      int64
 2   Surface Area  7 non-null      int64
 3   HDI           7 non-null      float64
 4   Continent     7 non-null      object
dtypes: float64(2), int64(2), object(1)
memory usage: 412.0+ bytes

In [7]:
data3=[{'Name':'John','Age':30},{'Name':'Jane','Age':35},{'name':'Mike','Age':28}]
df6=pd.DataFrame(data3)
df6

   Name  Age  name
0  John   30   NaN
1  Jane   35   NaN
2   NaN   28  Mike

In [1]:
import pandas as pd

# Task pandas
### Series

#Exercise 1:
Create a pandas series containing the top 5 programming languages used in 2021, along with their respective popularity index (in descending order). Then, extract the third item from the series.

In [2]:
programming_languages=pd.Series({'Python':100,'JavaScript':95,'Java':90,'C++':80,'C#':75})
series1=programming_languages.iloc[2]
series1

90

#Exercise 2:
Create a Pandas series with the following data: [1, 2, 3, 4, 5]. Then, calculate the sum, mean, and standard deviation of the series.

In [4]:
series2=pd.Series([1,2,3,4,5])
print(series2.sum())
print(series2.mean())
print(series2.std())

15
3.0
1.5811388300841898

#Exercise 3:
Create a Pandas series with the following data: {'apples': 3, 'bananas': 2, 'oranges': 1}. Then, add a new item to the series with the key 'pears' and the value 4.

In [6]:
fruits=pd.Series({'Apples':3,'banana':2,'oranges':1})
fruits

Apples     3
banana     2
oranges    1
dtype: int64

In [7]:
fruits['pears']=4
fruits

Apples     3
banana     2
oranges    1
pears      4
dtype: int64

#Exercise 4:
Create a Pandas series with the following data: [1, 2, 3, 4, 5]. Then, filter the series to only include values greater than 2.

In [13]:
series3=pd.Series([1,2,3,4,5])
series=series3[series3>2]
series

2    3
3    4
4    5
dtype: int64

#Exercise 5:
Create a Pandas series with the following data: [1, 3, 5, 7, 9]. Then, change the index to ['a', 'b', 'c', 'd', 'e'].

In [14]:
series4=pd.Series([1,3,5,7,9])
series4

0    1
1    3
2    5
3    7
4    9
dtype: int64

In [15]:
series4.index=['a','b','c','d','e']
series4

a    1
b    3
c    5
d    7
e    9
dtype: int64

# DataFrame

#Exercise 1:
Create a dataframe with the following columns: name, age, and gender. The dataframe should have 10 rows of data, with the following values

In [17]:
data = {
    'name': ['John', 'Sonia', 'Abilash', 'Sophia', 'William', 'Kartika', 'James', 'Anagha', 'Sooraj', 'Archana'],
    'age': [25, 32, 41, 28, 37, 29, 36, 33, 27, 31],
    'gender': ['Male', 'Female', 'Male', 'Female', 'Male', 'Female', 'Male', 'Female', 'Male', 'Female']
    
}
df=pd.DataFrame(data)
df

      name  age  gender
0     John   25    Male
1    Sonia   32  Female
2  Abilash   41    Male
3   Sophia   28  Female
4  William   37    Male
5  Kartika   29  Female
6    James   36    Male
7   Anagha   33  Female
8   Sooraj   27    Male
9  Archana   31  Female

#Exercise 2:
Add a new column to the data frame created in question 1, called occupation. The values for this column should be Programmer, Manager, and Analyst, corresponding to the rows in the dataframe.

In [18]:
df['occupation']=['Programmer','Manager','Analyst','Programmer', 'Manager', 'Analyst',
                    'Programmer', 'Manager', 'Analyst', 'Programmer']
df

      name  age  gender  occupation
0     John   25    Male  Programmer
1    Sonia   32  Female     Manager
2  Abilash   41    Male     Analyst
3   Sophia   28  Female  Programmer
4  William   37    Male     Manager
5  Kartika   29  Female     Analyst
6    James   36    Male  Programmer
7   Anagha   33  Female     Manager
8   Sooraj   27    Male     Analyst
9  Archana   31  Female  Programmer

#Exercise 3:
Select the rows of the dataframe where the age is greater than or equal to 30.

In [22]:
df[df['age']>=30]

      name  age  gender  occupation
1    Sonia   32  Female     Manager
2  Abilash   41    Male     Analyst
4  William   37    Male     Manager
6    James   36    Male  Programmer
7   Anagha   33  Female     Manager
9  Archana   31  Female  Programmer

#Exercise 4:
Sort the data frame by age in descending order.

In [24]:
df.sort_values(by='age',ascending=False)

      name  age  gender  occupation
2  Abilash   41    Male     Analyst
4  William   37    Male     Manager
6    James   36    Male  Programmer
7   Anagha   33  Female     Manager
1    Sonia   32  Female     Manager
9  Archana   31  Female  Programmer
5  Kartika   29  Female     Analyst
3   Sophia   28  Female  Programmer
8   Sooraj   27    Male     Analyst
0     John   25    Male  Programmer

In [1]:
import pandas as pd

In [4]:
df5.columns

Index(['Population', 'GDP', 'Surface Area', 'HDI', 'Continent'], dtype='object')

In [7]:
df5.index

RangeIndex(start=0, stop=7, step=1)

In [9]:
df5.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Population    7 non-null      float64
 1   GDP           7 non-null      int64
 2   Surface Area  7 non-null      int64
 3   HDI           7 non-null      float64
 4   Continent     7 non-null      object
dtypes: float64(2), int64(2), object(1)
memory usage: 412.0+ bytes

In [10]:
data3=[{'Name':'John','Age':30},{'Name':'Jane','Age':35},{'name':'Mike','Age':28}]
df6=pd.DataFrame(data3)
df6

   Name  Age  name
0  John   30   NaN
1  Jane   35   NaN
2   NaN   28  Mike

In [11]:
df6.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    2 non-null      object
 1   Age     3 non-null      int64
 2   name    1 non-null      object
dtypes: int64(1), object(2)
memory usage: 204.0+ bytes

In [12]:
import numpy as np

In [16]:
df7=pd.DataFrame([[1,np.nan,2],[np.nan,5,6]])
df7

     0    1  2
0  1.0  NaN  2
1  NaN  5.0  6

In [17]:
df7.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2 entries, 0 to 1
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       1 non-null      float64
 1   1       1 non-null      float64
 2   2       2 non-null      int64
dtypes: float64(2), int64(1)
memory usage: 180.0 bytes

In [18]:
df5.shape

(7, 5)

In [19]:
df5.size

35

In [20]:
df5.dtypes

Population      float64
GDP               int64
Surface Area      int64
HDI             float64
Continent        object
dtype: object

In [21]:
df5.describe()

       Population           GDP  Surface Area       HDI
count    7.000000  7.000000e+00  7.000000e+00  7.000000
mean   107.302571  5.080248e+06  3.061327e+06  0.900429
std     97.249970  5.494020e+06  4.576187e+06  0.016592
min     35.467000  1.785387e+06  2.424950e+05  0.873000
25%     62.308000  2.500716e+06  3.292250e+05  0.889500
50%     64.511000  2.950039e+06  3.779300e+05  0.907000
75%    104.000500  4.238402e+06  5.082873e+06  0.914000
max    318.523000  1.734808e+07  9.984670e+06  0.916000

In [22]:
df5.describe(include="all")

        Population           GDP  Surface Area       HDI Continent
count     7.000000  7.000000e+00  7.000000e+00  7.000000         7
unique         NaN           NaN           NaN       NaN         3
top            NaN           NaN           NaN       NaN    Europe
freq           NaN           NaN           NaN       NaN         4
mean    107.302571  5.080248e+06  3.061327e+06  0.900429       NaN
std      97.249970  5.494020e+06  4.576187e+06  0.016592       NaN
min      35.467000  1.785387e+06  2.424950e+05  0.873000       NaN
25%      62.308000  2.500716e+06  3.292250e+05  0.889500       NaN
50%      64.511000  2.950039e+06  3.779300e+05  0.907000       NaN
75%     104.000500  4.238402e+06  5.082873e+06  0.914000       NaN
max     318.523000  1.734808e+07  9.984670e+06  0.916000       NaN

In [23]:
df5.head()

   Population      GDP  Surface Area    HDI Continent
0      35.467  1785387       9984670  0.913   America
1      63.951  2833687        640679  0.888    Europe
2      80.940  3874437        357114  0.916    Europe
3      60.665  2167744        301336  0.873    Europe
4     127.061  4602367        377930  0.891      Asia

In [24]:
df5.head(3)

   Population      GDP  Surface Area    HDI Continent
0      35.467  1785387       9984670  0.913   America
1      63.951  2833687        640679  0.888    Europe
2      80.940  3874437        357114  0.916    Europe

In [25]:
df5.tail()

   Population       GDP  Surface Area    HDI Continent
2      80.940   3874437        357114  0.916    Europe
3      60.665   2167744        301336  0.873    Europe
4     127.061   4602367        377930  0.891      Asia
5      64.511   2950039        242495  0.907    Europe
6     318.523  17348075       9525067  0.915   America

In [26]:
df5.tail(2)

   Population       GDP  Surface Area    HDI Continent
5      64.511   2950039        242495  0.907    Europe
6     318.523  17348075       9525067  0.915   America

In [27]:
df5['Continent'].value_counts()

Continent
Europe     4
America    2
Asia       1
Name: count, dtype: int64

In [28]:
df5['Population'].value_counts()

Population
35.467     1
63.951     1
80.940     1
60.665     1
127.061    1
64.511     1
318.523    1
Name: count, dtype: int64

In [29]:
df5.sort_values(by='Population')

   Population       GDP  Surface Area    HDI Continent
0      35.467   1785387       9984670  0.913   America
3      60.665   2167744        301336  0.873    Europe
1      63.951   2833687        640679  0.888    Europe
5      64.511   2950039        242495  0.907    Europe
2      80.940   3874437        357114  0.916    Europe
4     127.061   4602367        377930  0.891      Asia
6     318.523  17348075       9525067  0.915   America

In [31]:
df5.sort_values(by="Population",ascending=False)

   Population       GDP  Surface Area    HDI Continent
6     318.523  17348075       9525067  0.915   America
4     127.061   4602367        377930  0.891      Asia
2      80.940   3874437        357114  0.916    Europe
5      64.511   2950039        242495  0.907    Europe
1      63.951   2833687        640679  0.888    Europe
3      60.665   2167744        301336  0.873    Europe
0      35.467   1785387       9984670  0.913   America

In [33]:
df5

   Population       GDP  Surface Area    HDI Continent
0      35.467   1785387       9984670  0.913   America
1      63.951   2833687        640679  0.888    Europe
2      80.940   3874437        357114  0.916    Europe
3      60.665   2167744        301336  0.873    Europe
4     127.061   4602367        377930  0.891      Asia
5      64.511   2950039        242495  0.907    Europe
6     318.523  17348075       9525067  0.915   America

In [36]:
df7=pd.DataFrame(np.array([['John',25,5000],['Alice',None,7000],['Bob',18,None],[None,40,6000]])
        )
df7

       0     1     2
0   John    25  5000
1  Alice  None  7000
2    Bob    18  None
3   None    40  6000

In [37]:
print(df7.isnull())

       0      1      2
0  False  False  False
1  False   True  False
2  False  False   True
3   True  False  False

In [38]:
print(df7.notnull())

       0      1      2
0   True   True   True
1   True  False   True
2   True   True  False
3  False   True   True

In [39]:
df7.dropna()

      0   1     2
0  John  25  5000

In [40]:
df7.fillna('Unknown')

         0        1        2
0     John       25     5000
1    Alice  Unknown     7000
2      Bob       18  Unknown
3  Unknown       40     6000

In [42]:
df7.fillna(value={0:'X',1:20,2:5000})

       0   1     2
0   John  25  5000
1  Alice  20  7000
2    Bob  18  5000
3      X  40  6000

In [43]:
df5

   Population       GDP  Surface Area    HDI Continent
0      35.467   1785387       9984670  0.913   America
1      63.951   2833687        640679  0.888    Europe
2      80.940   3874437        357114  0.916    Europe
3      60.665   2167744        301336  0.873    Europe
4     127.061   4602367        377930  0.891      Asia
5      64.511   2950039        242495  0.907    Europe
6     318.523  17348075       9525067  0.915   America

In [44]:
df5[['Population','GDP']]

   Population       GDP
0      35.467   1785387
1      63.951   2833687
2      80.940   3874437
3      60.665   2167744
4     127.061   4602367
5      64.511   2950039
6     318.523  17348075

In [45]:
df5[['Population','GDP']]/100

   Population        GDP
0     0.35467   17853.87
1     0.63951   28336.87
2     0.80940   38744.37
3     0.60665   21677.44
4     1.27061   46023.67
5     0.64511   29500.39
6     3.18523  173480.75

In [47]:
crisis=pd.Series([-1_000_000,-3],index=['GDP','HDI'])
crisis

GDP   -1000000
HDI         -3
dtype: int64

In [48]:
df5[['GDP','HDI']]

        GDP    HDI
0   1785387  0.913
1   2833687  0.888
2   3874437  0.916
3   2167744  0.873
4   4602367  0.891
5   2950039  0.907
6  17348075  0.915

In [50]:
df5[['GDP','HDI']]+crisis

        GDP    HDI
0    785387 -2.087
1   1833687 -2.112
2   2874437 -2.084
3   1167744 -2.127
4   3602367 -2.109
5   1950039 -2.093
6  16348075 -2.085

In [51]:
df5['Population']/df5['GDP']

0    0.000020
1    0.000023
2    0.000021
3    0.000028
4    0.000028
5    0.000022
6    0.000018
dtype: float64

In [53]:
df5['GDP per Capita']=df5['Population']/df5['GDP']
df5

   Population       GDP  Surface Area    HDI Continent  GDP per Capita
0      35.467   1785387       9984670  0.913   America        0.000020
1      63.951   2833687        640679  0.888    Europe        0.000023
2      80.940   3874437        357114  0.916    Europe        0.000021
3      60.665   2167744        301336  0.873    Europe        0.000028
4     127.061   4602367        377930  0.891      Asia        0.000028
5      64.511   2950039        242495  0.907    Europe        0.000022
6     318.523  17348075       9525067  0.915   America        0.000018

In [55]:
langs=pd.Series(['French','German','Italian'],index=['France','Germany','Italy'],name='Language')
langs

France      French
Germany     German
Italy      Italian
Name: Language, dtype: object

In [56]:
df5['Language']=langs
df5

,Population,GDP,Surface Area,HDI,Continent,GDP per Capita,Language
0,35.467,1785387,9984670,0.913,America,0.000020,NaN
1,63.951,2833687,640679,0.888,Europe,0.000023,NaN
2,80.940,3874437,357114,0.916,Europe,0.000021,NaN
3,60.665,2167744,301336,0.873,Europe,0.000028,NaN
4,127.061,4602367,377930,0.891,Asia,0.000028,NaN
5,64.511,2950039,242495,0.907,Europe,0.000022,NaN
6,318.523,17348075,9525067,0.915,America,0.000018,NaN

In [58]:
df5['Language']=df5['Language'].replace(['NaN'],'English')
df5

,Population,GDP,Surface Area,HDI,Continent,GDP per Capita,Language
0,35.467,1785387,9984670,0.913,America,0.000020,NaN
1,63.951,2833687,640679,0.888,Europe,0.000023,NaN
2,80.940,3874437,357114,0.916,Europe,0.000021,NaN
3,60.665,2167744,301336,0.873,Europe,0.000028,NaN
4,127.061,4602367,377930,0.891,Asia,0.000028,NaN
5,64.511,2950039,242495,0.907,Europe,0.000022,NaN
6,318.523,17348075,9525067,0.915,America,0.000018,NaN

In [60]:
df5['Language']='English'
df5

,Population,GDP,Surface Area,HDI,Continent,GDP per Capita,Language
0,35.467,1785387,9984670,0.913,America,0.000020,English
1,63.951,2833687,640679,0.888,Europe,0.000023,English
2,80.940,3874437,357114,0.916,Europe,0.000021,English
3,60.665,2167744,301336,0.873,Europe,0.000028,English
4,127.061,4602367,377930,0.891,Asia,0.000028,English
5,64.511,2950039,242495,0.907,Europe,0.000022,English
6,318.523,17348075,9525067,0.915,America,0.000018,English

In [61]:
df5

,Population,GDP,Surface Area,HDI,Continent,GDP per Capita,Language
0,35.467,1785387,9984670,0.913,America,0.000020,English
1,63.951,2833687,640679,0.888,Europe,0.000023,English
2,80.940,3874437,357114,0.916,Europe,0.000021,English
3,60.665,2167744,301336,0.873,Europe,0.000028,English
4,127.061,4602367,377930,0.891,Asia,0.000028,English
5,64.511,2950039,242495,0.907,Europe,0.000022,English
6,318.523,17348075,9525067,0.915,America,0.000018,English

In [62]:
df5.rename(columns={'HDI':'Human Development Index','Anual Popcorn Consumption':'APC'},
          index={'United States':'USA','United Kingdom':'UK','Argentina':'AR'})
df5

,Population,GDP,Surface Area,HDI,Continent,GDP per Capita,Language
0,35.467,1785387,9984670,0.913,America,0.000020,English
1,63.951,2833687,640679,0.888,Europe,0.000023,English
2,80.940,3874437,357114,0.916,Europe,0.000021,English
3,60.665,2167744,301336,0.873,Europe,0.000028,English
4,127.061,4602367,377930,0.891,Asia,0.000028,English
5,64.511,2950039,242495,0.907,Europe,0.000022,English
6,318.523,17348075,9525067,0.915,America,0.000018,English

In [66]:
df5.loc['1']=[3,5,0,0,0,0,0]
df5

,Population,GDP,Surface Area,HDI,Continent,GDP per Capita,Language
0,35.467,1785387,9984670,0.913,America,0.000020,English
1,63.951,2833687,640679,0.888,Europe,0.000023,English
2,80.940,3874437,357114,0.916,Europe,0.000021,English
3,60.665,2167744,301336,0.873,Europe,0.000028,English
4,127.061,4602367,377930,0.891,Asia,0.000028,English
5,64.511,2950039,242495,0.907,Europe,0.000022,English
6,318.523,17348075,9525067,0.915,America,0.000018,English
1,3.000,5,0,0.000,0,0.000000,0

In [68]:
df5.to_csv('sample_file.csv')

In [69]:
s1=pd.read_csv('sample_file.csv')

In [70]:
s1.head()

,Unnamed: 0,Population,GDP,Surface Area,HDI,Continent,GDP per Capita,Language
0,0,35.467,1785387,9984670,0.913,America,0.000020,English
1,1,63.951,2833687,640679,0.888,Europe,0.000023,English
2,2,80.940,3874437,357114,0.916,Europe,0.000021,English
3,3,60.665,2167744,301336,0.873,Europe,0.000028,English
4,4,127.061,4602367,377930,0.891,Asia,0.000028,English